Autodesk.Revit.DB.Lighting.CustomInitialColor.Temperature
The custom color temperature value.
The color temperature in Kelvin as a numerical value between 1800 and 20000
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The color temperature is not valid because it is not in the range of 1800 to 20000.
Since:
2013

Autodesk.Revit.DB.Lighting.CustomInitialColor.#ctor(Autodesk.Revit.DB.Lighting.CustomInitialColor)
Creates a copy of the given custom initial color
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.CustomInitialColor.#ctor(System.Double)
Creates a custom initial color set to the given color
temperature:
The color temperature in Kelvin as a numerical value between 1800 and 20000
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The color temperature is not valid because it is not in the range of 1800 to 20000.
Since:
2013

Autodesk.Revit.DB.Lighting.CustomInitialColor
This class encapsulates a custom initial lighting color.
Remarks:
This color is called an initial color because a color filter can also be added to modify the color.
Since:
2013